[Killed] BlockStatement
controllers/authController.js:6:38
 const jwt = require("jsonwebtoken");
 
 // Signup
-exports.signup = async (req, res) => {
-  try {
-    const existingUser = await User.findOne({ email: req.body.email });
-
-    if (existingUser) {
-      return res.status(400).json({ error: "User already exists" });
-    }
-
-    // Hash password
-    const hashedPassword = await bcrypt.hash(req.body.password, 10);
-
-    const user = new User({
-      ...req.body,
-      password: hashedPassword
-    });
-
-    await user.save();
-
-    res.json({ message: "User created" });
-  } catch (err) {
-    res.status(500).json({ error: err.message });
-  }
-};
+exports.signup = async (req, res) => {};
 
 // Login
killedBy: authController - signup should create a new user successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"email": "test@example.com"}

Number of calls: 0

[Killed] BlockStatement
controllers/authController.js:7:7
 
 // Signup
 exports.signup = async (req, res) => {
-  try {
-    const existingUser = await User.findOne({ email: req.body.email });
-
-    if (existingUser) {
-      return res.status(400).json({ error: "User already exists" });
-    }
-
-    // Hash password
-    const hashedPassword = await bcrypt.hash(req.body.password, 10);
-
-    const user = new User({
-      ...req.body,
-      password: hashedPassword
-    });
-
-    await user.save();
-
-    res.json({ message: "User created" });
-  } catch (err) {
+  try {} catch (err) {
     res.status(500).json({ error: err.message });
   }
killedBy: authController - signup should create a new user successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"email": "test@example.com"}

Number of calls: 0

[Killed] ObjectLiteral
controllers/authController.js:8:45
 // Signup
 exports.signup = async (req, res) => {
   try {
-    const existingUser = await User.findOne({ email: req.body.email });
+    const existingUser = await User.findOne({});
 
     if (existingUser) {
killedBy: authController - signup should create a new user successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "email": "test@example.com",
- }

[Killed] BlockStatement
controllers/authController.js:10:23
   try {
     const existingUser = await User.findOne({ email: req.body.email });
 
-    if (existingUser) {
-      return res.status(400).json({ error: "User already exists" });
-    }
+    if (existingUser) {}
 
     // Hash password
killedBy: authController - signup should return 400 if user already exists
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 200

[Killed] StringLiteral
controllers/authController.js:11:44
     const existingUser = await User.findOne({ email: req.body.email });
 
     if (existingUser) {
-      return res.status(400).json({ error: "User already exists" });
+      return res.status(400).json({ error: "" });
     }
 
killedBy: authController - signup should return 400 if user already exists
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "error": "User already exists",
+   "error": "",

[Killed] ObjectLiteral
controllers/authController.js:11:35
     const existingUser = await User.findOne({ email: req.body.email });
 
     if (existingUser) {
-      return res.status(400).json({ error: "User already exists" });
+      return res.status(400).json({});
     }
 
killedBy: authController - signup should return 400 if user already exists
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Object {
-   "error": "User already exists",
- }

[Killed] ObjectLiteral
controllers/authController.js:17:27
     // Hash password
     const hashedPassword = await bcrypt.hash(req.body.password, 10);
 
-    const user = new User({
-      ...req.body,
-      password: hashedPassword
-    });
+    const user = new User({});
 
     await user.save();
killedBy: authController - signup should hash the password with bcrypt before saving
statusReason: Error: Illegal arguments: string, undefined

[Killed] ObjectLiteral
controllers/authController.js:24:14
 
     await user.save();
 
-    res.json({ message: "User created" });
+    res.json({});
   } catch (err) {
     res.status(500).json({ error: err.message });
killedBy: authController - signup should create a new user successfully
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Object {
-   "message": "User created",
- }

[Killed] BlockStatement
controllers/authController.js:25:17
     await user.save();
 
     res.json({ message: "User created" });
-  } catch (err) {
-    res.status(500).json({ error: err.message });
-  }
+  } catch (err) {}
 };
 
killedBy: authController - signup should return 500 on internal error
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 500
Received: 200

[Killed] BlockStatement
controllers/authController.js:35:16
   try {
     const user = await User.findOne({ email: req.body.email });
 
-    if (!user) {
-      return res.status(400).json({ error: "Invalid credentials" });
-    }
+    if (!user) {}
 
     // Compare password
killedBy: authController - login should return 400 if user not found
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 500

[Killed] StringLiteral
controllers/authController.js:36:44
     const user = await User.findOne({ email: req.body.email });
 
     if (!user) {
-      return res.status(400).json({ error: "Invalid credentials" });
+      return res.status(400).json({ error: "" });
     }
 
killedBy: authController - login should return 400 if user not found
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "error": "Invalid credentials",
+   "error": "",

[Killed] BlockStatement
controllers/authController.js:45:19
       user.password
     );
 
-    if (!isMatch) {
-      return res.status(400).json({ error: "Invalid credentials" });
-    }
+    if (!isMatch) {}
 
     // Create token
killedBy: authController - login should return 400 if password does not match
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 200

[Killed] StringLiteral
controllers/authController.js:46:44
     );
 
     if (!isMatch) {
-      return res.status(400).json({ error: "Invalid credentials" });
+      return res.status(400).json({ error: "" });
     }
 
killedBy: authController - login should return 400 if password does not match
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "error": "Invalid credentials",
+   "error": "",

[Killed] ObjectLiteral
controllers/authController.js:53:7
     const token = jwt.sign(
       { userId: user._id },
       "secretkey",
-      { expiresIn: "1h" }
+      {}
     );
 
killedBy: authController - login should create token with 1h expiry
statusReason: Error: expect(received).toHaveProperty(path)

Expected path: "exp"
Received path: []

Received value: {"iat": 1775499889, "userId": "uid1"}

[Killed] StringLiteral
controllers/authController.js:53:20
     const token = jwt.sign(
       { userId: user._id },
       "secretkey",
-      { expiresIn: "1h" }
+      { expiresIn: "" }
     );
 
killedBy: authController - login should login successfully with valid credentials
statusReason: Error: expect(received).toHaveProperty(path)

Expected path: "token"
Received path: []

Received value: {"error": "\"expiresIn\" should be a number of seconds or string representing a timespan"}

[Killed] BlockStatement
controllers/authController.js:57:17
     );
 
     res.json({ token });
-  } catch (err) {
-    res.status(500).json({ error: err.message });
-  }
+  } catch (err) {}
 };
killedBy: authController - login should return 500 on internal error
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 500
Received: 200
