[Killed] BlockStatement
controllers/projectController.js:4:45
 const Project = require("../models/Project");
 
 // Create Project
-exports.createProject = async (req, res) => {
-  try {
-    const project = new Project(req.body);
-    await project.save();
-    res.json(project);
-  } catch (err) {
-    res.status(500).json({ error: err.message });
-  }
-};
+exports.createProject = async (req, res) => {};
 
 // Get Projects
killedBy: projectController - createProject should create a project successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
controllers/projectController.js:5:7
 
 // Create Project
 exports.createProject = async (req, res) => {
-  try {
-    const project = new Project(req.body);
-    await project.save();
-    res.json(project);
-  } catch (err) {
+  try {} catch (err) {
     res.status(500).json({ error: err.message });
   }
killedBy: projectController - createProject should create a project successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
controllers/projectController.js:9:17
     const project = new Project(req.body);
     await project.save();
     res.json(project);
-  } catch (err) {
-    res.status(500).json({ error: err.message });
-  }
+  } catch (err) {}
 };
 
killedBy: projectController - createProject should return 500 on error
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 500
Received: 200

[Killed] BlockStatement
controllers/projectController.js:15:43
 };
 
 // Get Projects
-exports.getProjects = async (req, res) => {
-  try {
-    const projects = await Project.find().populate("createdBy");
-    res.json(projects);
-  } catch (err) {
-    res.status(500).json({ error: err.message });
-  }
-};
+exports.getProjects = async (req, res) => {};
killedBy: projectController - getProjects should return all projects with populated createdBy
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
controllers/projectController.js:16:7
 
 // Get Projects
 exports.getProjects = async (req, res) => {
-  try {
-    const projects = await Project.find().populate("createdBy");
-    res.json(projects);
-  } catch (err) {
+  try {} catch (err) {
     res.status(500).json({ error: err.message });
   }
killedBy: projectController - getProjects should return all projects with populated createdBy
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Survived] StringLiteral
controllers/projectController.js:17:52
 // Get Projects
 exports.getProjects = async (req, res) => {
   try {
-    const projects = await Project.find().populate("createdBy");
+    const projects = await Project.find().populate("");
     res.json(projects);
   } catch (err) {

[Killed] BlockStatement
controllers/projectController.js:19:17
   try {
     const projects = await Project.find().populate("createdBy");
     res.json(projects);
-  } catch (err) {
-    res.status(500).json({ error: err.message });
-  }
+  } catch (err) {}
 };
killedBy: projectController - getProjects should return 500 on error
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 500
Received: 200
