[Killed] BlockStatement
middleware/auth.middleware.js:3:38
 const jwt = require("jsonwebtoken");
 
-module.exports = (req, res, next) => {
-  try {
-    const token = req.headers.authorization;
-
-    if (!token) {
-      return res.status(401).json({ error: "No token" });
-    }
-
-    const decoded = jwt.verify(token, "secretkey");
-
-    req.user = decoded;
-    next();
-  } catch (err) {
-    res.status(401).json({ error: "Invalid token" });
-  }
-};
+module.exports = (req, res, next) => {};
killedBy: auth.middleware should call next() and set req.user with a valid token
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
middleware/auth.middleware.js:4:7
 const jwt = require("jsonwebtoken");
 
 module.exports = (req, res, next) => {
-  try {
-    const token = req.headers.authorization;
-
-    if (!token) {
-      return res.status(401).json({ error: "No token" });
-    }
-
-    const decoded = jwt.verify(token, "secretkey");
-
-    req.user = decoded;
-    next();
-  } catch (err) {
+  try {} catch (err) {
     res.status(401).json({ error: "Invalid token" });
   }
killedBy: auth.middleware should call next() and set req.user with a valid token
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] StringLiteral
middleware/auth.middleware.js:8:44
     const token = req.headers.authorization;
 
     if (!token) {
-      return res.status(401).json({ error: "No token" });
+      return res.status(401).json({ error: "" });
     }
 
killedBy: auth.middleware should return 401 if no token is provided
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "error": "No token",
+   "error": "",

[Killed] StringLiteral
middleware/auth.middleware.js:11:39
       return res.status(401).json({ error: "No token" });
     }
 
-    const decoded = jwt.verify(token, "secretkey");
+    const decoded = jwt.verify(token, "");
 
     req.user = decoded;
killedBy: auth.middleware should call next() and set req.user with a valid token
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
middleware/auth.middleware.js:15:17
 
     req.user = decoded;
     next();
-  } catch (err) {
-    res.status(401).json({ error: "Invalid token" });
-  }
+  } catch (err) {}
 };
killedBy: auth.middleware should return 401 if token is invalid
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 401
Received: 200

[Killed] ObjectLiteral
middleware/auth.middleware.js:16:26
     req.user = decoded;
     next();
   } catch (err) {
-    res.status(401).json({ error: "Invalid token" });
+    res.status(401).json({});
   }
 };
killedBy: auth.middleware should return 401 if token is invalid
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Object {
-   "error": "Invalid token",
- }
