[Killed] BlockStatement
controllers/taskController.js:5:42
 const mongoose = require("mongoose");
 
 // Create Task
-exports.createTask = async (req, res) => {
-  try {
-    const task = new Task({
-      ...req.body,
-      createdBy: req.user.userId   // 🔥 from token
-    });
-
-    await task.save();
-    res.json(task);
-  } catch (err) {
-    res.status(500).json({ error: err.message });
-  }
-};
+exports.createTask = async (req, res) => {};
 
 // Get Tasks (with filter)
killedBy: taskController - createTask should create a task with createdBy from token
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
controllers/taskController.js:6:7
 
 // Create Task
 exports.createTask = async (req, res) => {
-  try {
-    const task = new Task({
-      ...req.body,
-      createdBy: req.user.userId   // 🔥 from token
-    });
-
-    await task.save();
-    res.json(task);
-  } catch (err) {
+  try {} catch (err) {
     res.status(500).json({ error: err.message });
   }
killedBy: taskController - createTask should create a task with createdBy from token
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ObjectLiteral
controllers/taskController.js:7:27
 // Create Task
 exports.createTask = async (req, res) => {
   try {
-    const task = new Task({
-      ...req.body,
-      createdBy: req.user.userId   // 🔥 from token
-    });
+    const task = new Task({});
 
     await task.save();
killedBy: taskController - createTask should create a task with createdBy from token
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "user123"
Received: undefined

[Killed] BlockStatement
controllers/taskController.js:14:17
 
     await task.save();
     res.json(task);
-  } catch (err) {
-    res.status(500).json({ error: err.message });
-  }
+  } catch (err) {}
 };
 
killedBy: taskController - createTask should return 500 on error
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 500
Received: 200

[Killed] BlockStatement
controllers/taskController.js:20:40
 };
 
 // Get Tasks (with filter)
-exports.getTasks = async (req, res) => {
-  try {
-    const filter = {};
-
-    if (req.query.project) {
-      filter.project = new mongoose.Types.ObjectId(req.query.project);
-    }
-
-    const tasks = await Task.find(filter)
-      .populate("assignedTo", "-password")
-      .populate("project");
-
-    res.json(tasks);
-  } catch (err) {
-    res.status(500).json({ error: err.message });
-  }
-};
+exports.getTasks = async (req, res) => {};
 
 // Update Task
killedBy: taskController - getTasks should return tasks without project filter
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {}

Number of calls: 0

[Killed] BlockStatement
controllers/taskController.js:21:7
 
 // Get Tasks (with filter)
 exports.getTasks = async (req, res) => {
-  try {
-    const filter = {};
-
-    if (req.query.project) {
-      filter.project = new mongoose.Types.ObjectId(req.query.project);
-    }
-
-    const tasks = await Task.find(filter)
-      .populate("assignedTo", "-password")
-      .populate("project");
-
-    res.json(tasks);
-  } catch (err) {
+  try {} catch (err) {
     res.status(500).json({ error: err.message });
   }
killedBy: taskController - getTasks should return tasks without project filter
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {}

Number of calls: 0

[Killed] ConditionalExpression
controllers/taskController.js:24:9
   try {
     const filter = {};
 
-    if (req.query.project) {
+    if (true) {
       filter.project = new mongoose.Types.ObjectId(req.query.project);
     }
killedBy: taskController - getTasks should return tasks without project filter
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {}
+ Object {
+   "project": "69d3fa75d262ab2e703a0b14",

[Killed] BlockStatement
controllers/taskController.js:24:28
   try {
     const filter = {};
 
-    if (req.query.project) {
-      filter.project = new mongoose.Types.ObjectId(req.query.project);
-    }
+    if (req.query.project) {}
 
     const tasks = await Task.find(filter)
killedBy: taskController - getTasks should filter by project when query param provided
statusReason: Error: expect(received).toHaveProperty(path)

Expected path: "project"
Received path: []

Received value: {}

[Killed] StringLiteral
controllers/taskController.js:29:17
     }
 
     const tasks = await Task.find(filter)
-      .populate("assignedTo", "-password")
+      .populate("", "-password")
       .populate("project");
 
killedBy: taskController - getTasks should populate assignedTo without password and project
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "assignedTo", "-password"
Received: "", "-password"

Number of calls: 1

[Killed] StringLiteral
controllers/taskController.js:29:31
     }
 
     const tasks = await Task.find(filter)
-      .populate("assignedTo", "-password")
+      .populate("assignedTo", "")
       .populate("project");
 
killedBy: taskController - getTasks should populate assignedTo without password and project
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "assignedTo", "-password"
Received: "assignedTo", ""

Number of calls: 1

[Killed] StringLiteral
controllers/taskController.js:30:17
 
     const tasks = await Task.find(filter)
       .populate("assignedTo", "-password")
-      .populate("project");
+      .populate("");
 
     res.json(tasks);
killedBy: taskController - getTasks should populate assignedTo without password and project
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "project"
Received: ""

Number of calls: 1

[Killed] BlockStatement
controllers/taskController.js:33:17
       .populate("project");
 
     res.json(tasks);
-  } catch (err) {
-    res.status(500).json({ error: err.message });
-  }
+  } catch (err) {}
 };
 
killedBy: taskController - getTasks should return 500 on error
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 500
Received: 200

[Killed] BlockStatement
controllers/taskController.js:39:42
 };
 
 // Update Task
-exports.updateTask = async (req, res) => {
-  try {
-    const task = await Task.findByIdAndUpdate(
-      req.params.id,
-      req.body,
-      { new: true }
-    );
-    res.json(task);
-  } catch (err) {
-    res.status(500).json({ error: err.message });
-  }
-};
+exports.updateTask = async (req, res) => {};
 
 // Delete Task
killedBy: taskController - updateTask should update a task successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "task1", {"status": "done", "title": "Updated"}, {"new": true}

Number of calls: 0

[Killed] BlockStatement
controllers/taskController.js:40:7
 
 // Update Task
 exports.updateTask = async (req, res) => {
-  try {
-    const task = await Task.findByIdAndUpdate(
-      req.params.id,
-      req.body,
-      { new: true }
-    );
-    res.json(task);
-  } catch (err) {
+  try {} catch (err) {
     res.status(500).json({ error: err.message });
   }
killedBy: taskController - updateTask should update a task successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "task1", {"status": "done", "title": "Updated"}, {"new": true}

Number of calls: 0

[Killed] BooleanLiteral
controllers/taskController.js:44:14
     const task = await Task.findByIdAndUpdate(
       req.params.id,
       req.body,
-      { new: true }
+      { new: false }
     );
     res.json(task);
killedBy: taskController - updateTask should update a task successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "task1",
  {"status": "done", "title": "Updated"},
  Object {

[Killed] BlockStatement
controllers/taskController.js:53:42
 };
 
 // Delete Task
-exports.deleteTask = async (req, res) => {
-  try {
-    await Task.findByIdAndDelete(req.params.id);
-    res.json({ message: "Task deleted" });
-  } catch (err) {
-    res.status(500).json({ error: err.message });
-  }
-};
+exports.deleteTask = async (req, res) => {};
killedBy: taskController - deleteTask should delete a task successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "task1"

Number of calls: 0

[Killed] BlockStatement
controllers/taskController.js:54:7
 
 // Delete Task
 exports.deleteTask = async (req, res) => {
-  try {
-    await Task.findByIdAndDelete(req.params.id);
-    res.json({ message: "Task deleted" });
-  } catch (err) {
+  try {} catch (err) {
     res.status(500).json({ error: err.message });
   }
killedBy: taskController - deleteTask should delete a task successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "task1"

Number of calls: 0

[Killed] BlockStatement
controllers/taskController.js:57:17
   try {
     await Task.findByIdAndDelete(req.params.id);
     res.json({ message: "Task deleted" });
-  } catch (err) {
-    res.status(500).json({ error: err.message });
-  }
+  } catch (err) {}
 };
killedBy: taskController - deleteTask should return 500 on error
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 500
Received: 200
