[Killed] BlockStatement
routes/issue.routes.js:4:38
 const router = require("express").Router();
 const Issue = require("../models/Issue");
 
-router.post("/", async (req, res) => {
-  const issue = await Issue.create(req.body);
-  res.json(issue);
-});
+router.post("/", async (req, res) => {});
 
 router.get("/:projectId", async (req, res) => {
killedBy: Issue Routes should create an issue when calling POST /
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Survived] StringLiteral
routes/issue.routes.js:4:13
 const router = require("express").Router();
 const Issue = require("../models/Issue");
 
-router.post("/", async (req, res) => {
+router.post("", async (req, res) => {
   const issue = await Issue.create(req.body);
   res.json(issue);

[Killed] BlockStatement
routes/issue.routes.js:9:47
   res.json(issue);
 });
 
-router.get("/:projectId", async (req, res) => {
-  const issues = await Issue.find({ projectId: req.params.projectId });
-  res.json(issues);
-});
+router.get("/:projectId", async (req, res) => {});
 
 router.put("/:id", async (req, res) => {
killedBy: Issue Routes should get issues by projectId when calling GET /:projectId
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] BlockStatement
routes/issue.routes.js:14:40
   res.json(issues);
 });
 
-router.put("/:id", async (req, res) => {
-  const issue = await Issue.findByIdAndUpdate(req.params.id, req.body, { new: true });
-  res.json(issue);
-});
+router.put("/:id", async (req, res) => {});
 
 module.exports = router;
killedBy: Issue Routes should update an issue by id when calling PUT /:id
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] BooleanLiteral
routes/issue.routes.js:15:79
 });
 
 router.put("/:id", async (req, res) => {
-  const issue = await Issue.findByIdAndUpdate(req.params.id, req.body, { new: true });
+  const issue = await Issue.findByIdAndUpdate(req.params.id, req.body, { new: false });
   res.json(issue);
 });
killedBy: Issue Routes should update an issue by id when calling PUT /:id
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "1",
  {"title": "Updated title"},
  Object {
