[Killed] ObjectLiteral
models/Issue.js:3:41
 const mongoose = require("mongoose");
 
-const issueSchema = new mongoose.Schema({
-  title: String,
-  description: String,
-  status: {
-    type: String,
-    enum: ["Backlog", "Ready", "In Progress", "In Review", "Done"],
-    default: "Backlog"
-  },
-  projectId: { type: mongoose.Schema.Types.ObjectId, ref: "Project" }
-});
+const issueSchema = new mongoose.Schema({});
 
 module.exports = mongoose.model("Issue", issueSchema);
killedBy: Issue Model should have correct schema definition
statusReason: TypeError: Cannot read properties of undefined (reading 'name')

[Killed] StringLiteral
models/Issue.js:8:60
   description: String,
   status: {
     type: String,
-    enum: ["Backlog", "Ready", "In Progress", "In Review", "Done"],
+    enum: ["Backlog", "Ready", "In Progress", "In Review", ""],
     default: "Backlog"
   },
killedBy: Issue Model should have correct schema definition
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    "Backlog",
    "Ready",

[Killed] StringLiteral
models/Issue.js:8:12
   description: String,
   status: {
     type: String,
-    enum: ["Backlog", "Ready", "In Progress", "In Review", "Done"],
+    enum: ["", "Ready", "In Progress", "In Review", "Done"],
     default: "Backlog"
   },
killedBy: Issue Model should have correct schema definition
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   "Backlog",
+   "",

[Killed] ObjectLiteral
models/Issue.js:11:14
     enum: ["Backlog", "Ready", "In Progress", "In Review", "Done"],
     default: "Backlog"
   },
-  projectId: { type: mongoose.Schema.Types.ObjectId, ref: "Project" }
+  projectId: {}
 });
 
killedBy: Issue Model should have correct schema definition
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: [Function ObjectId]
Received: undefined

[Killed] StringLiteral
models/Issue.js:11:59
     enum: ["Backlog", "Ready", "In Progress", "In Review", "Done"],
     default: "Backlog"
   },
-  projectId: { type: mongoose.Schema.Types.ObjectId, ref: "Project" }
+  projectId: { type: mongoose.Schema.Types.ObjectId, ref: "" }
 });
 
killedBy: Issue Model should have correct schema definition
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Project"
Received: ""
