[Killed] BooleanLiteral
models/Project.js:6:15
 const projectSchema = new mongoose.Schema({
   name: {
     type: String,
-    required: true
+    required: false
   },
   description: String,
killedBy: Project Model should have correct schema definition
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false
