[Killed] StringLiteral
models/Task.js:12:10
   },
   assignedTo: {
     type: mongoose.Schema.Types.ObjectId,
-    ref: "User"
+    ref: ""
   },
   status: {
killedBy: Task Model should have correct schema definition
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "User"
Received: ""

[Killed] StringLiteral
models/Task.js:16:20
   },
   status: {
     type: String,
-    enum: ["todo", "in-progress", "done"],
+    enum: ["todo", "", "done"],
     default: "todo"
   },
killedBy: Task Model should have correct schema definition
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    "todo",
-   "in-progress",

[Killed] ArrayDeclaration
models/Task.js:16:11
   },
   status: {
     type: String,
-    enum: ["todo", "in-progress", "done"],
+    enum: [],
     default: "todo"
   },
killedBy: Task Model should have correct schema definition
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 5
+ Received  + 1

- Array [
-   "todo",
-   "in-progress",

[Killed] StringLiteral
models/Task.js:17:14
   status: {
     type: String,
     enum: ["todo", "in-progress", "done"],
-    default: "todo"
+    default: ""
   },
   createdBy: {
killedBy: Task Model should have correct schema definition
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "todo"
Received: ""

[Killed] ObjectLiteral
models/Task.js:23:14
   type: mongoose.Schema.Types.ObjectId,
   ref: "User"
 },
-  createdAt: {
-    type: Date,
-    default: Date.now
-  }
+  createdAt: {}
 });
 
killedBy: Task Model should have correct schema definition
statusReason: TypeError: Cannot read properties of undefined (reading 'name')
