[Survived] StringLiteral
routes/project.routes.js:10:12
 } = require("../controllers/projectController");
 
 router.post("/", createProject);
-router.get("/", getProjects);
+router.get("", getProjects);
 
 module.exports = router;
