[Survived] StringLiteral
routes/task.routes.js:11:13
   deleteTask
 } = require("../controllers/taskController");
 
-router.post("/", createTask);
+router.post("", createTask);
 router.get("/", getTasks);
 router.put("/:id", updateTask);
