[Killed] BooleanLiteral
models/User.js:5:34
 
 const userSchema = new mongoose.Schema({
   name: String,
-  email: { type: String, unique: true },
+  email: { type: String, unique: false },
   password: String
 });
killedBy: User Model should have correct schema definition
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ObjectLiteral
models/User.js:5:10
 
 const userSchema = new mongoose.Schema({
   name: String,
-  email: { type: String, unique: true },
+  email: {},
   password: String
 });
killedBy: User Model should have correct schema definition
statusReason: TypeError: Cannot read properties of undefined (reading 'name')
